# Install all the things:
brew 'bash-completion'
brew 'git'
brew 'diff-so-fancy'
brew 'less'
brew 'wget'
brew 'stow'
brew 'tmux'
brew 'htop'
brew 'ag'
brew 'tree'

# Databases
brew 'sqlite'
brew 'postgresql'

tap 'homebrew/cask'
cask_args appdir: '~/Applications', require_sha: true

# good ol cask apps
cask 'google-chrome'
cask 'firefox'
cask 'dropbox'
cask 'kitty'
cask 'skype'
cask 'slack'
cask 'spotify'
cask 'iterm2'
cask 'kap'
cask 'little-snitch'

# Command-not-found
# this is used by prezto's command-not-found module:
# https://github.com/sorin-ionescu/prezto/tree/master/modules/command-not-found#command-not-found
# https://github.com/Homebrew/homebrew-command-not-found#install
tap 'homebrew/command-not-found'
